/*
Дано двузначное число. Выведите его первую цифру (число десятков)
*/

#include <iostream>
using namespace std;
int main()
{
    int n;
    cin >> n;
    cout << n / 10 << endl;
    return 0;
}