/*
Дано натуральное число, выведите его последнюю цифру.
*/

#include <iostream>
using namespace std;
int main()
{
    int n;
    cin >> n;
    cout << n % 10 << endl;
    return 0;
}
